Show / Hide Table of Contents
Class Region3D
Represents a region in three-dimensional space included outline (border) and openings.
Inheritance
System.Object
OpenObject
OpenElementId
Region3D
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry3D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry3D.Region3D,CI.Geometry3D", "CI.Geometry3D.IRegion3D,CI.BasicTypes")]
public class Region3D : OpenElementId
Constructors
Improve this Doc   View Source
Region3D()
Constructor
Declaration
public Region3D()
Properties
Improve this Doc   View Source
Openings
Gets or sets the list of references to PolyLine3Dopenning curve in the Region3D.
Declaration
public List<ReferenceElement> Openings { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
Outline
Gets or sets the reference to PolyLine3D curve of Region3D.
Declaration
public ReferenceElement Outline { get; set; }
Property Value
 Type |  Description
 ReferenceElement
 Improve this Doc
 View Source